{
  "name": "Mod Compatibility",
  "icon": "minecraft:book",
  "category": "tips",
  "pages": [
    {
      "type": "text",
      "text": "Project Rankine affects many early game mechanics and worldgen. As such there are bound to be conflicts with other mods. The goal is to reduce these conflicts as much as possible and find ways to enhance the player experience when using multiple mods. If you have a question about a specific mod, please comment on the modpage or send a message on our discord."
    },
    {
      "type": "text",
      "title": "General",
      "text": "General compatibility features being implemented / planned to be include: $(li)Tags for as many things as possible $(li)Lots of config options $(li)Datapack-ability (WIP) $(br2)A general note about stone gen is that Rankine replaces vanilla stone after features have been populated so that other ores and features are able to spawn still."
    },
    {
      "type": "text",
      "title": "Patchouli",
      "text": "As you may have noticed, we have Patchouli support for this journal. This journal is under major development for every update as more and more information is added."
    },
    {
      "type": "text",
      "title": "JEI",
      "text": "JEI is a fantastic mod that presumably everyone uses. The combination of this journal and JEI are meant to guide you through the mod sucessfully. A lot of information and custum pages have been added to JEI that are very critical to the mod, such as alloy percentages. Updates to JEI will continue to occur."
    },
    {
      "type": "text",
      "title": "Quark",
      "text": "Quark is a mod that adds a lot of worldgen features. With default settings the two mods are very compatible. That is primarily seen through the underground biomes, caves and feature generation."
    },
    {
      "type": "text",
      "title": "Mekanism",
      "text": "Due to ore tags, certain Rankine ores can be processed by Mekanism machinery. The plan is to add ore processing support for all sensible Rankine ores. By default Mekanism adds a smelting recipe for the ores, but for progression through Rankine it is recomended to disable those through an external recipe editor."
    },
    {
      "type": "text",
      "title": "XXX Cave Mod",
      "text": "Yungs Better Caves and others work just fine and really enhance the visibility of the stone generation."
    },
    {
      "type": "text",
      "title": "TerraForged",
      "text": "TerraForged completely alters world generation in the underground by implementing their own stone layering system. Currently, if TerraForged is installed, it will use Rankine stones in generation. This however is random layering and not consistent with default Rankine. Ores and intrusions should be present in world."
    }
  ]
}