{
  "name": "Crushing",
  "icon": "rankine:wooden_hammer",
  "category": "rankine:mechanics",
  "pages": [
    {
      "type": "text",
      "text": "Crushing is a process that involves breaking blocks and items into smaller components. This is typically achieved by using a new tool, the $(l:tools/hammers)hammer$(). Crushing, and by association the hammer, work differently than the typical mining process."
    },
    {
      "type": "text",
      "text": "To crush a block in-world, you must swing your hammer at the right time. When the attack speed indicator (the sword that appears underneath your crosshair) is filled, you may swing your hammer to crush the block. Trying to swing before the attack speed indicator is filled will result in nothing happening. This means that a hammer with a faster attack speed stat will be able to break blocks at a quicker rate."
    },
    {
      "type": "text",
      "text": "The main thing that you need to consider when crushing a block is the crushing/harvest level of your tool. Similar to pickaxes, hammers cannot break blocks greater than its harvest level. However, the hammer's harvest level also influences how many rolls of the drops you will receive. JEI is the best source of information on the potential drops of any block when crushing it."
    },
    {
      "type": "text",
      "text": "Explain JEI here"
    },
    {
    "type": "text",
    "anchor": "crushing_heads",
    "text": "To automate the crushing process, pistons can be used to push a crushing head into a block. Place the crushing head on the face of the piston and then a one block gap before the desired block to be crushed. Works in any direction."
    },
    {
      "type": "rankine:item5",
      "header": "Crushing Heads",
      "item1": "rankine:wood_tier_crushing_head",
      "item2": "rankine:stone_tier_crushing_head",
      "item3": "rankine:iron_tier_crushing_head",
      "item4": "rankine:diamond_tier_crushing_head",
      "item5": "rankine:netherite_tier_crushing_head",
      "text": "The tier of the Crushing Head affects the drops much like the Hammers."
    }
  ]
}