{
  "name": "Stone Creation",
  "icon": "minecraft:cobblestone",
  "category": "mechanics",
  "pages": [
    {
      "type": "text",
      "text": "As the world is made up of lots of different stones, it might be confusing on how to get cobblestone. Cobblestone is obtained by crushing most igneous or metamorphic $(world/stones)stones$(). At the start, this is achieved by $(l:tools/hammers)Hammers$()."
    },
    {
      "type": "spotlight",
      "item": "rankine:pegmatite",
      "title": "Intrusive Igneous Stone Generator",
      "text": "As the title suggests there has been a tweak to the standard lava + water = cobblestone scheme. This tweak can be enabled/disabled in the config. By default, lava and flowing water will form a random intrusive igneous stones from Rankine. Using additional minerals in the genearator can allow for specific stone generation."
    },
    {
      "type": "spotlight",
      "item": "rankine:hornblende_andesite",
      "title": "Extrusive Igneous Stone Generator",
      "text": "As the title suggests there has been a tweak to the standard basalt generator. This tweak can be enabled/disabled in the config. By default, lava flowing into blue ice over soul soil will form a random extrusive igneous stones from Rankine. Using additional minerals in the genearator can allow for specific stone generation."
    },
    {
      "type": "spotlight",
      "item": "rankine:gneiss",
      "title": "Metamorphic Stone Generator",
      "text": "There has been a tweak to the standard stone generator. This tweak can be enabled/disabled in the config. By default, lava flowing onto water source blocks will form a random metamorphic stones from Rankine. Using additional stones in the genearator can allow for specific stone generation."
    },
    {
      "type": "crafting",
      "recipe": "rankine:sediment_fan",
      "title": "Sedimentary Stone Generator",
      "text": "Sedimentary stones are generated by the accumulation of granular material and compacted under pressure. To simulate this phenomena, "
    }
  ]
}