{
  "name": "Tree Tapping",
  "icon": "rankine:tree_tap",
  "category": "mechanics",
  "sortnum": 1,
  "pages": [
    {
      "type": "text",
      "text": "The Tree Tap is a device that extracts various fluids from logs. The tap block is just a stick that protrudes from a log. Right click with an empty bucket to hang it on the tap. A tap with a bucket will eventually fill with liquid and can be retrieved by right clicking. The extracted fluid is defined by the group of #rankine:logs_* tags. Additional equipment can be used to automate the tapping process."
    },
    {
      "type": "crafting",
      "recipe": "rankine:tree_tap",
      "text": "The tap operates on random ticks. By default it will extract every 3 ticks, but this can be adjusted in the config. Tree taps will not work if there is another one in any adjacent block. Also, the tree needs to be alive, meaning the tree must contained naturally spawned leaves."
    },
    {
      "type": "crafting",
      "recipe": "rankine:tap_barrel",
      "text": "The tap barrel is a tank for any fluid produced by tree tapping. It can hold six buckets worth of fluid. Right click with empty or full buckets to use. Has a comparator output based off level."
    },
    {
      "type": "crafting",
      "recipe": "rankine:fluid_drain",
      "text": "The fluid drain is like a hopper but for fluids. It will place a fluid block from a tap barrel above it. Useful for automating an evaporation tower setup."
    },
    {
      "type": "crafting",
      "recipe": "rankine:tap_line",
      "text": "Tap lines are essentially a pipe network for tree taps to output to a tap barrel. Fluids can not flow upwards. Tap lines will connect to a bucketed tree tap from below or to a tap barrel on the four sides. ~30 block max distance."
    },
    {
      "type": "spotlight",
      "item": "minecraft:water_bucket",
      "link_recipe": true,
      "text": "Water can be extracted from the three varieties of birch."
    },
    {
      "type": "spotlight",
      "item": "minecraft:lava_bucket",
      "link_recipe": true,
      "text": "Lava can be extracted from the nether trees."
    },
    {
      "type": "spotlight",
      "item": "rankine:latex_bucket",
      "link_recipe": true,
      "text": "Latex can be extracted from sharinga trees. Used to make dry rubber in the $(l:machines/evaporation_tower)Evaporation Tower$()."
    },
    {
      "type": "spotlight",
      "item": "rankine:maple_sap_bucket",
      "link_recipe": true,
      "text": "Maple sap can be extracted from maple trees. Used to make maple syrup in the $(l:machines/evaporation_tower)Evaporation Tower$()."
    },
    {
      "type": "spotlight",
      "item": "rankine:juglone_bucket",
      "link_recipe": true,
      "text": "Juglone can be extracted from black walnut trees. Used to craft herbicide."
    },
    {
      "type": "spotlight",
      "item": "rankine:sap_bucket",
      "link_recipe": true,
      "text": "Sap can be extracted from any other deciduous tree. Used to make sugar in the $(l:machines/evaporation_tower)Evaporation Tower$()."
    },
    {
      "type": "spotlight",
      "item": "rankine:resin_bucket",
      "link_recipe": true,
      "text": "Resin can be extracted from any other coniferous tree. Used to make amber in the $(l:machines/evaporation_tower)Evaporation Tower$()."
    }
  ]
}