{
  "name": "Guide",
  "icon": "rankine:refractory_bricks",
  "category": "guide",
  "pages": [
    {
      "type": "text",
      "title": "Starting Technology",
      "text": "Speaking of clay, you are going to need to gather a bit of it in order to make $(l:materials/refractory_bricks)Refractory Bricks$(). These will be used to create an $(l:machines/alloy_furnace)Alloy Furnace$() and a $(l:machines/beehive_oven)Beehive Oven$(). Make Beehive Ovens early and possibly multiple to stockpile resources needed for later. Also, coke is a good fuel so you might as well convert all of your subbituminous and bituminous coal to coke. Also craft a $(l:machines:coal_forge)Coal Forge$() and the corresponding tool templates."
    },
    {
      "type": "text",
      "text": "The Alloy Furnace can be used to make $(l:alloying/alloy_furnace_alloys)Alloys$(). Make a harvest level 1 tool by making pewter or bronze alloy and forging the appropriate tool in the Coal Forge. A pickaxe and hammer are always recommended."
    },
    {
      "type": "text",
      "title": "The Age of Discovery",
      "text": "There are two simple goals once you can harvest tier 1 ores: gather resources to build infrastructure and a base, and to find meteorites. The ores available to you now include malachite, cassiterite, bauxite, and sphalerite. Most Rankine mineral ores have to be crushed to yield their mineral which is then smelted in a blast furnace. $(l:exploration/meteorites)Meteorites$() contain an ore that can be used directly to make Meteoric Iron tools, which is equivalent to vanilla iron tools. "
    },
    {
      "type": "text",
      "title": "To Steel and Beyond",
      "text": "Now that you can get iron and other higher tier ores by using iron-level tools, you can now start working towards the production of Steel. In order to do so, you will need to make higher tier Refractory Bricks using materials such as Magnesia or Dolomite. You will need 40 high refractory brick to make the crucible, which is used to make Crucible Steel. You will also need to produce Pig Iron and Wrought Iron."
    },
    {
      "type": "text",
      "text": "Pig Iron is made by blasting an Iron Ingot in the blast furnace, and Wrought Iron is made from crushing Sponge Iron in a Piston Crusher. Sponge Iron is produced by cooking a Block of Pig Iron via a Beehive Oven Pit. Once the Crucible is constructed, place it above a heat source (fire, lava, magma blocks) and right-click with a Pig Iron Ingot in your hand. This will produce molten Pig Iron, which you can then right-click with Wrought Iron in order to produce Steel."
    },
    {
      "type": "text",
      "text": "You can use three Wrought Iron Ingots per Pig Iron used in the Crucible to make three Steel. At this point, you may make Steel tools to gain greater access to the ores in the world. At this point, you may explore the rest of Project Rankine, such as making some of the multiblock structures like the Evaporation Tower or Laser Quarry, or tinker with alloys to make even stronger tools. The End and Nether also contain additional materials which may aid you in discovery. Good luck!"
    }
  ]
}
